In [1]:
import pandas as pd

In [2]:
reserve_tb = pd.read_csv('reserve.csv')
result = reserve_tb.groupby('hotel_id').agg({'reserve_id': 'count', 'customer_id': 'nunique'})
result.reset_index(inplace=True)
result.head()

  hotel_id  reserve_id  customer_id
0      h_1          10           10
1     h_10           3            3
2    h_100          20           19
3    h_101          17           17
4    h_102          13           13

In [3]:
result.columns = ['hotel_id', 'rsv_cnt', 'customer_id']
result.head()

  hotel_id  rsv_cnt  customer_id
0      h_1       10           10
1     h_10        3            3
2    h_100       20           19
3    h_101       17           17
4    h_102       13           13

In [4]:
result = result.rename(columns={'customer_id': 'cus_cnt'})
result.head()

  hotel_id  rsv_cnt  cus_cnt
0      h_1       10       10
1     h_10        3        3
2    h_100       20       19
3    h_101       17       17
4    h_102       13       13